## Plan Result (ithc_backendappgateway)




<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw"
        name                              = "cft-aks00-ithc-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/aac-manage-case-assignment" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "aac-manage-case-assignment" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/adoption-cos-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "adoption-cos-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/am-org-role-mapping-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "am-org-role-mapping-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/am-role-assignment-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "am-role-assignment-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/bar-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "bar-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/camunda-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "camunda-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/camunda-bpm" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "camunda-bpm" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/camunda-optimize" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "camunda-optimize" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccd-admin-web" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccd-admin-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccd-case-activity-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccd-case-activity-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccd-case-document-am-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccd-case-document-am-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccd-data-store-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccd-data-store-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccd-definition-store-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccd-definition-store-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccd-message-publisher" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccd-message-publisher" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccd-user-profile-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccd-user-profile-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccpay-bulkscanning-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccpay-bulkscanning-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccpay-notifications-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccpay-notifications-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/ccpay-refunds-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ccpay-refunds-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/civil-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "civil-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/cmc-claim-store" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "cmc-claim-store" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/cmc-pdf-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "cmc-pdf-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/cpo-case-payment-orders-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "cpo-case-payment-orders-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/dg-docassembly" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "dg-docassembly" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/dg-docmosis" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "dg-docmosis" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-cfs" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-cfs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-cms" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-cms" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-cos" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-cos" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-da" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-da" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-dgs" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-dgs" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-dn" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-dn" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-emca" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-emca" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-fps" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-fps" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-hm" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-hm" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-pfe" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-pfe" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/div-rfe" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "div-rfe" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/dm-store" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "dm-store" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/draft-store-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "draft-store-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/em-anno" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "em-anno" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw/backendAddressPools/em-ccd-orchestrator" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "em-ccd-orchestrator" -> null
        }
      - backend_address_pool {
          - fqdns        =

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

     + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "sscs-tya-notif"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "wa-case-event-handler"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "wa-task-management-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "wa-task-monitor"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "wa-workflow-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "xui-activity-tracker-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "xui-terms-and-conditions"
        }

        # (401 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw"
        name                              = "cft-aks01-ithc-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/am-judicial-booking-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "am-judicial-booking-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/civil-general-applications" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "civil-general-applications" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/civil-orchestrator-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "civil-orchestrator-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/civil-sdt" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "civil-sdt" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/civil-sdt-commissioning" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "civil-sdt-commissioning" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/civil-sdt-gateway" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "civil-sdt-gateway" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/et-cos" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "et-cos" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/et-hearings-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "et-hearings-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/et-msg-handler" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "et-msg-handler" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/et-sya-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "et-sya-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/fis-bulk-scan-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "fis-bulk-scan-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/fis-cos-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "fis-cos-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/fis-hmc-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "fis-hmc-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/hmc-cft-hearing-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "hmc-cft-hearing-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/hmc-hmi-inbound-adapter" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "hmc-hmi-inbound-adapter" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/hmc-hmi-outbound-adapter" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "hmc-hmi-outbound-adapter" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/idam-hmcts-access" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "idam-hmcts-access" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/idam-testing-support-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "idam-testing-support-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/jps-judicial-payment-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "jps-judicial-payment-service" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/sptribs-case-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "sptribs-case-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/sscs-hearings-api" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "sscs-hearings-api" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw/backendAddressPools/ts-translation-service" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "ts-translation-service" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "am-judicial-booking-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "civil-general-applications"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "civil-orchestrator-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "civil-sdt"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "civil-sdt-commissioning"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "civil-sdt-gateway"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "et-cos"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "et-hearings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "et-msg-handler"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "et-sya-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "fis-bulk-scan-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "fis-cos-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "fis-hmc-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "hmc-cft-hearing-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "hmc-hmi-inbound-adapter"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "hmc-hmi-outbound-adapter"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "idam-hmcts-access"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "idam-testing-support-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "jps-judicial-payment-service"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "sptribs-case-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "sscs-hearings-api"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.11.223.250",
            ]
          + name         = "ts-translation-service"
        }

        # (98 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-ithc-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-ithc-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1639,"Program":"tfcmt","SHA1":"","Target":"ithc_backendappgateway","Vars":{}} -->